Catalogs/упПартнеры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>упПартнеры</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АдресВозвратаДокументов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упАдреса</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АЗС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидТранспорта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упВидыТранспорта</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Календари</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаДоступа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упГруппыДоступаПартнеров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Comment>Используется при анализе первичного интереса</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоступныеРесурсы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упПравилаДоступностиРесурсов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заказчик</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Comment>Полное наименование, например, для печати.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойМенеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отправитель</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПакетПечатныхФормЗадание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упШаблоныПакетовПечатныхФорм</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПакетПечатныхФормРейс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упШаблоныПакетовПечатныхФорм</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПакетРегламентныхДокументов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упПакетыРегламентныхДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Перевозчик</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрочиеОтношения</Name>
					<Comment>Прочие отношения</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РейтингПеревозчика</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СервиснаяОрганизация</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладАЗС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтильОтображенияМаршрута</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСтилиЛиний</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Страховщик</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуетсяОформлениеПутевогоЛиста</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЮридическоеЛицо</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновноеСоглашение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСоглашенияСКлиентами</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДоступныеТипыТС</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТипТС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упТипыТС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоМакс</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТорговыеПредставители</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТорговыйПредставитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упСотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/упПеревозчикПоРейсу.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>упПеревозчикПоРейсу</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Перевозчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упПартнеры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Соглашение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСоглашенияСПеревозчиками</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КонтрагентПеревозчика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипТС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упТипыТС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТранспортноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Водитель1</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Водитель2</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Экспедитор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Рейс</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.упРейс</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/упАдресаПартнеров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>упАдресаПартнеров</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Календари</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упПартнеры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упАдреса</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/упИерархияПартнеров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>упИерархияПартнеров</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Уровень</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упПартнеры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Родитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упПартнеры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/упВариантыВыбораПеревозчика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>упВариантыВыбораПеревозчика</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПеревозкаСобственнымиТС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеревозкаОпределеннымПеревозчиком</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НепосредственныйВыборВРейсе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОформляетсяТендер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОпределяетсяДляКаждогоРейсаИндивидуально</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/упПартнеры/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает таблицу перевозчиков по рейсу.
//
// Параметры:
//  ОбъектСсылка  - СправочникСсылка - Ссылка на элемент.
//
// Возвращаемое значение:
//   ТаблицаЗначений   - Результат выполнения.
//
Функция ПолучитьСписокПеревозчиков(ОбъектСсылка) Экспорт
	
	тбзПеревозчики = Новый ТаблицаЗначений;
	
	Если ТипЗнч(ОбъектСсылка) = тип("ДокументСсылка.упРейс") Тогда
		текЗапрос = Новый Запрос;
		текЗапрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕСТЬNULL(упПеревозчикПоРейсуСрезПоследних.ТипТС, ЗНАЧЕНИЕ(Справочник.упТипыТС.ПустаяСсылка)) КАК ТипТС,
		|	упРейс.ВидПеревозки КАК ВидПеревозки,
		|	упРейс.Ссылка КАК Ссылка,
		|	ЕСТЬNULL(упПеревозчикПоРейсуСрезПоследних.Перевозчик, ЗНАЧЕНИЕ(Справочник.упПартнеры.ПустаяСсылка)) КАК Перевозчик
		|ПОМЕСТИТЬ втРейс
		|ИЗ
		|	Документ.упРейс КАК упРейс
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упПеревозчикПоРейсу.СрезПоследних(, Рейс = &Ссылка) КАК упПеревозчикПоРейсуСрезПоследних
		|		ПО упРейс.Ссылка = упПеревозчикПоРейсуСрезПоследних.Рейс
		|ГДЕ
		|	упРейс.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	упПартнеры.Ссылка КАК Перевозчик
		|ПОМЕСТИТЬ втПеревозчики
		|ИЗ
		|	Справочник.упПартнеры КАК упПартнеры
		|ГДЕ
		|	упПартнеры.Перевозчик
		|	И НЕ упПартнеры.ПометкаУдаления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	упВидыПеревозок.Перевозчик КАК Перевозчик
		|ПОМЕСТИТЬ втПеревозчикиПоВидуПеревозки
		|ИЗ
		|	Справочник.упВидыПеревозок КАК упВидыПеревозок
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втПеревозчики КАК втПеревозчики
		|		ПО упВидыПеревозок.Перевозчик = втПеревозчики.Перевозчик
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втРейс КАК втРейс
		|		ПО упВидыПеревозок.Ссылка = втРейс.ВидПеревозки
		|ГДЕ
		|	упВидыПеревозок.ВыборПеревозчика = ЗНАЧЕНИЕ(Перечисление.упВариантыВыбораПеревозчика.ПеревозкаОпределеннымПеревозчиком)
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	упВидыПеревозокПеревозчикиДляТендера.Перевозчик
		|ИЗ
		|	Справочник.упВидыПеревозок.ПеревозчикиДляТендера КАК упВидыПеревозокПеревозчикиДляТендера
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втПеревозчики КАК втПеревозчики
		|		ПО упВидыПеревозокПеревозчикиДляТендера.Перевозчик = втПеревозчики.Перевозчик
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втРейс КАК втРейс
		|		ПО упВидыПеревозокПеревозчикиДляТендера.Ссылка = втРейс.ВидПеревозки
		|ГДЕ
		|	упВидыПеревозокПеревозчикиДляТендера.Ссылка.ВыборПеревозчика = ЗНАЧЕНИЕ(Перечисление.упВариантыВыбораПеревозчика.ОформляетсяТендер)
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	втПеревозчики.Перевозчик
		|ИЗ
		|	Справочник.упВидыПеревозок КАК упВидыПеревозок
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втПеревозчики КАК втПеревозчики
		|		ПО (ИСТИНА)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втРейс КАК втРейс
		|		ПО упВидыПеревозок.Ссылка = втРейс.ВидПеревозки
		|ГДЕ
		|	упВидыПеревозок.ВыборПеревозчика = ЗНАЧЕНИЕ(Перечисление.упВариантыВыбораПеревозчика.ОпределяетсяДляКаждогоРейсаИндивидуально)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	упЗаявкаНаТС.Перевозчик КАК Перевозчик
		|ПОМЕСТИТЬ втПеревозчикиЕстьЗаявкаНаТС
		|ИЗ
		|	Документ.упЗаявкаНаТС КАК упЗаявкаНаТС
		|ГДЕ
		|	упЗаявкаНаТС.Рейс = &Ссылка
		|	И упЗаявкаНаТС.Проведен
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	упТранспортныеСредства.Партнер КАК Перевозчик
		|ПОМЕСТИТЬ втПеревозчикиПоТипуТС
		|ИЗ
		|	Справочник.упТранспортныеСредства КАК упТранспортныеСредства
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втРейс КАК втРейс
		|		ПО упТранспортныеСредства.ТипТС = втРейс.ТипТС
		|		ЛЕВОЕ СОЕДИНЕНИЕ втПеревозчикиПоВидуПеревозки КАК втПеревозчикиПоВидуПеревозки
		|		ПО (ИСТИНА)
		|ГДЕ
		|	упТранспортныеСредства.Партнер.Перевозчик
		|	И втПеревозчикиПоВидуПеревозки.Перевозчик ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втПеревозчики.Перевозчик КАК Перевозчик,
		|	МИНИМУМ(втПеревозчики.Флаг) КАК Флаг,
		|	МАКСИМУМ(втПеревозчики.СформированыЗаявки) КАК СформированыЗаявки,
		|	МИНИМУМ(втПеревозчики.УказанВВидеПеревозки) КАК УказанВВидеПеревозки,
		|	МИНИМУМ(втПеревозчики.СовпадаетТипТС) КАК СовпадаетТипТС
		|ПОМЕСТИТЬ втПеревозчикиИтог
		|ИЗ
		|	(ВЫБРАТЬ
		|		втПеревозчики.Перевозчик КАК Перевозчик,
		|		ИСТИНА КАК Флаг,
		|		ЛОЖЬ КАК СформированыЗаявки,
		|		ИСТИНА КАК УказанВВидеПеревозки,
		|		ЛОЖЬ КАК СовпадаетТипТС
		|	ИЗ
		|		втПеревозчикиПоВидуПеревозки КАК втПеревозчики
		|	
		|	ОБЪЕДИНИТЬ
		|	
		|	ВЫБРАТЬ
		|		втПеревозчики.Перевозчик,
		|		ЛОЖЬ,
		|		ИСТИНА,
		|		ЛОЖЬ,
		|		ЛОЖЬ
		|	ИЗ
		|		втПеревозчикиЕстьЗаявкаНаТС КАК втПеревозчики
		|	
		|	ОБЪЕДИНИТЬ
		|	
		|	ВЫБРАТЬ
		|		втПеревозчики.Перевозчик,
		|		ЛОЖЬ,
		|		ЛОЖЬ,
		|		ЛОЖЬ,
		|		ИСТИНА
		|	ИЗ
		|		втПеревозчикиПоТипуТС КАК втПеревозчики
		|	
		|	ОБЪЕДИНИТЬ
		|	
		|	ВЫБРАТЬ
		|		втПеревозчики.Перевозчик,
		|		ИСТИНА,
		|		ЛОЖЬ,
		|		ЛОЖЬ,
		|		ЛОЖЬ
		|	ИЗ
		|		втПеревозчики КАК втПеревозчики
		|			ЛЕВОЕ СОЕДИНЕНИЕ втПеревозчикиПоВидуПеревозки КАК втПеревозчикиПоВидуПеревозки
		|			ПО (ИСТИНА)
		|	ГДЕ
		|		втПеревозчикиПоВидуПеревозки.Перевозчик ЕСТЬ NULL) КАК втПеревозчики
		|
		|СГРУППИРОВАТЬ ПО
		|	втПеревозчики.Перевозчик
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втПеревозчики.Перевозчик КАК Перевозчик,
		|	втПеревозчики.Флаг КАК Флаг,
		|	втПеревозчики.СформированыЗаявки КАК СформированыЗаявки,
		|	втПеревозчики.УказанВВидеПеревозки КАК УказанВВидеПеревозки,
		|	втПеревозчики.СовпадаетТипТС КАК СовпадаетТипТС,
		|	упСоглашенияСПеревозчиками.Ссылка КАК Соглашение
		|ИЗ
		|	втПеревозчикиИтог КАК втПеревозчики
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.упСоглашенияСПеревозчиками КАК упСоглашенияСПеревозчиками
		|		ПО втПеревозчики.Перевозчик = упСоглашенияСПеревозчиками.Владелец";
		текЗапрос.УстановитьПараметр("Ссылка", ОбъектСсылка);
		тбзПеревозчики = текЗапрос.Выполнить().Выгрузить();
		Если тбзПеревозчики.Количество()>0 Тогда
			тбзПеревозчики.Колонки.Добавить("Расходы", Новый ОписаниеТипов("Число"));
			упТарификацияВызовСервера.Рассчитать(тбзПеревозчики, Новый Структура("СпособРасчета, Рейс", "РассчитатьПоСпискуПеревозчиков", ОбъектСсылка));
			тбзПеревозчики.Сортировать("Расходы");
		КонецЕсли;
	КонецЕсли;

	Возврат тбзПеревозчики;	
	
КонецФункции

// Функция возвращает адреса партнера.
//
// Параметры:
//  Ссылка  - СправочникСсылка.упПартнеры - Ссылка на элемент.
//
// Возвращаемое значение:
//   Массив - Массив адресов, отсортированных по дате изменения (первыми стоят последние использовавшиеся).
//
Функция ПолучитьАдресаПартнера(Ссылка) Экспорт
	
	мсвАдресов = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	упАдресаПартнеров.Адрес
	|ИЗ
	|	РегистрСведений.упАдресаПартнеров КАК упАдресаПартнеров
	|ГДЕ
	|	упАдресаПартнеров.Партнер = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	упАдресаПартнеров.ДатаИзменения УБЫВ";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Результат = Запрос.Выполнить();
	Если Не Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			мсвАдресов.Добавить(Выборка.Адрес);
		КонецЦикла; 	
	КонецЕсли; 
	
	Возврат мсвАдресов;
	
КонецФункции // ПолучитьАдресаПартнера()

// Функция возвращает график работы точки партнера.
//
// Параметры:
//  Партнер  - СправочникСсылка.упПартнеры - Ссылка на элемент.
//  Адрес    - СправочникСсылка.упАдреса - Ссылка на элемент.
//
// Возвращаемое значение:
//   СправочникСсылка.Календари - Неопределено, Результат выполнения.
//
Функция ПолучитьГрафикРаботыТочкиПартнера(Партнер, Адрес) Экспорт
	
	ГрафикРаботы = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	упАдресаПартнеров.ГрафикРаботы
	|ИЗ
	|	РегистрСведений.упАдресаПартнеров КАК упАдресаПартнеров
	|ГДЕ
	|	упАдресаПартнеров.Партнер = &Партнер
	|	И упАдресаПартнеров.Адрес = &Адрес";
	Запрос.УстановитьПараметр("Партнер", Партнер);
	Запрос.УстановитьПараметр("Адрес", Адрес);
	Результат = Запрос.Выполнить();
	Если Не Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
	    ГрафикРаботы = Выборка.ГрафикРаботы;
	КонецЕсли; 
	
	Возврат ГрафикРаботы;
	
КонецФункции // ПолучитьГрафикРаботыТочкиПартнера()

#Область ИерархияПартнеров

// Процедура создает записи в РС "упИерархияПартнеров"
//
// Параметры:
//  Партнер	- СправочникСсылка.упПартнеры - Ссылка на элемент.
//
Процедура ЗаписатьИерархиюПартнера(Партнер) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	упПартнеры.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.упПартнеры КАК упПартнеры
	|ГДЕ
	|	упПартнеры.Ссылка В ИЕРАРХИИ(&Партнер)
	|ИТОГИ ПО
	|	Ссылка ИЕРАРХИЯ";
	Запрос.УстановитьПараметр("Партнер",Партнер);
	
	ДеревоИерархии = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	ТекущийЭлемент = ДеревоИерархии.Строки.Найти(Партнер, "Ссылка", Истина);
	Если ТекущийЭлемент <> Неопределено Тогда
		ВыполнитьЗаписьВИерархию(ТекущийЭлемент);
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ОбработчикиСобытий

// Нет.

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ВыполнитьЗаписьПоПодчиненным(СтрокиДерева,ТекущийЭлемент)
	
	Для каждого СтрокаДерева Из СтрокиДерева Цикл
		Если СтрокаДерева.Ссылка <> ТекущийЭлемент Тогда
			ВыполнитьЗаписьВИерархию(СтрокаДерева);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ВыполнитьЗаписьВИерархию(СтрокаДерева);
	
	НаборЗаписей = РегистрыСведений.упИерархияПартнеров.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Партнер.Установить(СтрокаДерева.Ссылка);
	
	РодительСтроки = СтрокаДерева;
	Пока РодительСтроки <> Неопределено Цикл
		ЗаписьНабора = НаборЗаписей.Добавить();
		ЗаписьНабора.Партнер  = СтрокаДерева.Ссылка;
		ЗаписьНабора.Родитель = РодительСтроки.Ссылка;
		ЗаписьНабора.Уровень  = РодительСтроки.Уровень();
		
		РодительСтроки 	= РодительСтроки.Родитель;
	КонецЦикла;
	
	НаборЗаписей.Записать();
	
	ВыполнитьЗаписьПоПодчиненным(СтрокаДерева.Строки, СтрокаДерева.Ссылка);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
